In [1]:
import os
os.chdir('/Users/Elizabeth.Ke.Zhang/Downloads/spark') 
os.getcwd()

import findspark
findspark.init('/Users/Elizabeth.Ke.Zhang/Downloads/spark')
import pyspark
from pyspark.sql import SQLContext
sc = pyspark.SparkContext()

import pandas as pd

In [2]:
sqlContext = SQLContext(sc)

In [9]:
os.chdir('/Users/Elizabeth.Ke.Zhang/Desktop') 
os.getcwd()

'/Users/Elizabeth.Ke.Zhang/Desktop'

In [11]:
pandasDF = pd.read_csv('/Users/Elizabeth.Ke.Zhang/Desktop/train.csv')
sparkDF = sqlContext.read.format('com.databricks.spark.csv') \
        .options(header='true').load('/Users/Elizabeth.Ke.Zhang/Desktop/train.csv')

In [12]:
pandasDF.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [13]:
sparkDF.count()

891

In [14]:
print(pandasDF.shape)

(891, 12)

In [15]:
print(sparkDF.shape())

AttributeError: 'DataFrame' object has no attribute 'shape'

In [16]:
pandasDF.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
sparkDF.head(5)

[Row(PassengerId='1', Survived='0', Pclass='3', Name='Braund, Mr. Owen Harris', Sex='male', Age='22', SibSp='1', Parch='0', Ticket='A/5 21171', Fare='7.25', Cabin=None, Embarked='S'),
 Row(PassengerId='2', Survived='1', Pclass='1', Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age='38', SibSp='1', Parch='0', Ticket='PC 17599', Fare='71.2833', Cabin='C85', Embarked='C'),
 Row(PassengerId='3', Survived='1', Pclass='3', Name='Heikkinen, Miss. Laina', Sex='female', Age='26', SibSp='0', Parch='0', Ticket='STON/O2. 3101282', Fare='7.925', Cabin=None, Embarked='S'),
 Row(PassengerId='4', Survived='1', Pclass='1', Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age='35', SibSp='1', Parch='0', Ticket='113803', Fare='53.1', Cabin='C123', Embarked='S'),
 Row(PassengerId='5', Survived='0', Pclass='3', Name='Allen, Mr. William Henry', Sex='male', Age='35', SibSp='0', Parch='0', Ticket='373450', Fare='8.05', Cabin=None, Embarked='S')]

In [18]:
sparkDF.show(5)

+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male| 35|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [19]:
pandasDF.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [20]:
sparkDF.tail()

AttributeError: 'DataFrame' object has no attribute 'tail'

In [21]:
pandasDF.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [22]:
sparkDF.schema

StructType(List(StructField(PassengerId,StringType,true),StructField(Survived,StringType,true),StructField(Pclass,StringType,true),StructField(Name,StringType,true),StructField(Sex,StringType,true),StructField(Age,StringType,true),StructField(SibSp,StringType,true),StructField(Parch,StringType,true),StructField(Ticket,StringType,true),StructField(Fare,StringType,true),StructField(Cabin,StringType,true),StructField(Embarked,StringType,true)))

In [23]:
sparkDF = sparkDF.withColumn('Age2', sparkDF['Age'].astype('float'))
sparkDF = sparkDF.drop('Age')
sparkDF.schema

StructType(List(StructField(PassengerId,StringType,true),StructField(Survived,StringType,true),StructField(Pclass,StringType,true),StructField(Name,StringType,true),StructField(Sex,StringType,true),StructField(SibSp,StringType,true),StructField(Parch,StringType,true),StructField(Ticket,StringType,true),StructField(Fare,StringType,true),StructField(Cabin,StringType,true),StructField(Embarked,StringType,true),StructField(Age2,FloatType,true)))

In [24]:
pandasDF[['Survived','Age','Fare','Pclass']].describe()

         Survived         Age        Fare      Pclass
count  891.000000  714.000000  891.000000  891.000000
mean     0.383838   29.699118   32.204208    2.308642
std      0.486592   14.526497   49.693429    0.836071
min      0.000000    0.420000    0.000000    1.000000
25%      0.000000   20.125000    7.910400    2.000000
50%      0.000000   28.000000   14.454200    3.000000
75%      1.000000   38.000000   31.000000    3.000000
max      1.000000   80.000000  512.329200    3.000000

In [25]:
sqlContext.createDataFrame(pandasDF[['Survived','Age','Fare','Pclass']]).describe().show()

+-------+-------------------+----+-----------------+-----------------+
|summary|           Survived| Age|             Fare|           Pclass|
+-------+-------------------+----+-----------------+-----------------+
|  count|                891| 891|              891|              891|
|   mean| 0.3838383838383838| NaN|32.20420796857464|2.308641975308642|
| stddev|0.48659245426485737| NaN|49.69342859718091|0.836071240977049|
|    min|                  0|0.42|              0.0|                1|
|    max|                  1| NaN|         512.3292|                3|
+-------+-------------------+----+-----------------+-----------------+

In [27]:
sparkDF.describe().show()

+-------+-----------------+-------------------+------------------+--------------------+------+------------------+-------------------+------------------+-----------------+-----+--------+------------------+
|summary|      PassengerId|           Survived|            Pclass|                Name|   Sex|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|              Age2|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+-------------------+------------------+-----------------+-----+--------+------------------+
|  count|              891|                891|               891|                 891|   891|               891|                891|               891|              891|  204|     889|               714|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642|                null|  null|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| null|    null| 29.69911764704046|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|                null|  null|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| null|    null|14.526497332370992|
|    min|                1|                  0|                 1|"Andersson, Mr. A...|female|                 0|                  0|            110152|                0|  A10|       C|              0.42|
|    max|               99|                  1|                 3|van Melkebeke, Mr...|  male|                 8|                  6|         WE/P 5735|             93.5|    T|       S|              80.0|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+-------------------+------------------+-----------------+-----+--------+------------------+

In [28]:
pandasDF2 = pandasDF.copy()
pandasDF2['Fare2'] = pandasDF['Fare'] + 2

In [29]:
pandasDF2[['Fare','Fare2']].head(5)

      Fare    Fare2
0   7.2500   9.2500
1  71.2833  73.2833
2   7.9250   9.9250
3  53.1000  55.1000
4   8.0500  10.0500

In [30]:
sparkDF = sparkDF.withColumn('Fare2',sparkDF['Fare'] + 2)

In [31]:
sparkDF[['Fare','Fare2']].show(5)

+-------+-------+
|   Fare|  Fare2|
+-------+-------+
|   7.25|   9.25|
|71.2833|73.2833|
|  7.925|  9.925|
|   53.1|   55.1|
|   8.05|  10.05|
+-------+-------+
only showing top 5 rows